<?php

namespace Me\Task7\Controllers;

use Me\Task7\Viewer;

class AboutController
{
    public function index(): void
    {
        $page = 'about';
        $title = 'About';
        $content = 'Інформація';
        $info = "Інформація - це знання або дані, які передаються або отримуються для використання у різних контекстах. 
        Інформація може бути представлена у різних формах, таких як текст, зображення, звук, відео тощо. 
        Вона може бути використана для сповіщення, навчання, розваг, прийняття рішень і багатьох інших цілей. 
        Інформація є важливою складовою сучасного світу і використовується у всіх сферах життя від особистого до професійного.";

        $view = new Viewer(
            [
                'page' => $page,
                'title' => $title,
                'content' => $content,
                'info' => $info
            ]
        );

        $view->render();
    }
}