<?php

namespace Me\Task7\Controllers;

use Me\Task7\Viewer;

class ContactsController
{
    public function index(): void
    {
        $page = 'contacts';
        $title = 'Contacts';
        $content = 'Контакти';
        $info = "Контакти - це інформація про способи зв`язку з конкретною людиною чи організацією. 
        Ця інформація може включати такі дані, як номер телефону, електронна пошта, 
        адреса місцезнаходження, посилання на соціальні мережі тощо. Контактна інформація дозволяє 
        іншим людям зв'язатися з вами або вашою організацією для різних цілей, наприклад, 
        для узгодження зустрічі, отримання додаткової інформації або обговорення питань.";

        $view = new Viewer(
            [
                'page' => $page,
                'title' => $title,
                'content' => $content,
                'info' => $info
            ]
        );

        $view->render();
    }
}